import Vue from "vue";
import Vuex from "vuex";

Vue.use(Vuex);

export default new Vuex.Store({
  state: {
    home: {
      socials: [
        {
          icon: '<svg fill="url(#main-gradient)" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 96.124 96.123"><path d="M72.089.02L59.624 0C45.62 0 36.57 9.285 36.57 23.656v10.907H24.037a1.96 1.96 0 0 0-1.96 1.961v15.803a1.96 1.96 0 0 0 1.96 1.96H36.57v39.876a1.96 1.96 0 0 0 1.96 1.96h16.352a1.96 1.96 0 0 0 1.96-1.96V54.287h14.654a1.96 1.96 0 0 0 1.96-1.96l.006-15.803a1.963 1.963 0 0 0-1.961-1.961H56.842v-9.246c0-4.444 1.059-6.7 6.848-6.7l8.397-.003a1.96 1.96 0 0 0 1.959-1.96V1.98A1.96 1.96 0 0 0 72.089.02z"/></svg>',
          link: '#'
        },
        {
          icon: '<svg fill="url(#main-gradient)" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 169.063 169.063"><path d="M122.406 0H46.654C20.929 0 0 20.93 0 46.655v75.752c0 25.726 20.929 46.655 46.654 46.655h75.752c25.727 0 46.656-20.93 46.656-46.655V46.655C169.063 20.93 148.133 0 122.406 0zm31.657 122.407c0 17.455-14.201 31.655-31.656 31.655H46.654C29.2 154.063 15 139.862 15 122.407V46.655C15 29.201 29.2 15 46.654 15h75.752c17.455 0 31.656 14.201 31.656 31.655v75.752z"/><path d="M84.531 40.97c-24.021 0-43.563 19.542-43.563 43.563 0 24.02 19.542 43.561 43.563 43.561s43.563-19.541 43.563-43.561c0-24.021-19.542-43.563-43.563-43.563zm0 72.123c-15.749 0-28.563-12.812-28.563-28.561 0-15.75 12.813-28.563 28.563-28.563s28.563 12.813 28.563 28.563c0 15.749-12.814 28.561-28.563 28.561zM129.921 28.251c-2.89 0-5.729 1.17-7.77 3.22a11.053 11.053 0 0 0-3.23 7.78c0 2.891 1.18 5.73 3.23 7.78 2.04 2.04 4.88 3.22 7.77 3.22 2.9 0 5.73-1.18 7.78-3.22 2.05-2.05 3.22-4.89 3.22-7.78 0-2.9-1.17-5.74-3.22-7.78-2.04-2.05-4.88-3.22-7.78-3.22z"/></svg>',
          link: '#'
        },
        {
          icon: '<svg fill="url(#main-gradient)" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 300 300"><path d="M5.299 144.645l69.126 25.8 26.756 86.047c1.712 5.511 8.451 7.548 12.924 3.891l38.532-31.412a11.496 11.496 0 0 1 14.013-.391l69.498 50.457c4.785 3.478 11.564.856 12.764-4.926L299.823 29.22c1.31-6.316-4.896-11.585-10.91-9.259L5.218 129.402c-7.001 2.7-6.94 12.612.081 15.243zm91.57 12.066l135.098-83.207c2.428-1.491 4.926 1.792 2.841 3.726L123.313 180.87a23.112 23.112 0 0 0-7.163 13.829l-3.798 28.146c-.503 3.758-5.782 4.131-6.819.494l-14.607-51.325c-1.673-5.854.765-12.107 5.943-15.303z"/></svg>',
          link: '#'
        },
        {
          icon: '<svg fill="url(#main-gradient)" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 430.123 430.123"><defs><linearGradient id="main-gradient" x1="100%" y1="0%" x2="0%" y2="0%"><stop offset="0%" style="stop-color:rgb(0,79,158);stop-opacity:1" /><stop offset="100%" style="stop-color:rgb(0,171,228);stop-opacity:1" /></linearGradient></defs><path d="M388.432 119.12H280.659V92.35h107.782v26.77h-.009zm-179.52 109.775c6.954 10.771 10.429 23.849 10.429 39.203 0 15.878-3.918 30.122-11.889 42.704-5.071 8.326-11.367 15.359-18.932 21.021-8.52 6.548-18.607 11.038-30.203 13.437-11.633 2.403-24.224 3.617-37.787 3.617H0V81.247h129.25c32.579.53 55.676 9.969 69.315 28.506 8.184 11.369 12.239 25.011 12.239 40.868 0 16.362-4.104 29.454-12.368 39.401-4.597 5.577-11.388 10.65-20.378 15.229 13.617 4.985 23.949 12.835 30.854 23.644zM61.722 186.76h56.632c11.638 0 21.046-2.212 28.292-6.634 7.241-4.415 10.854-12.263 10.854-23.531 0-12.449-4.784-20.712-14.375-24.689-8.244-2.763-18.792-4.186-31.591-4.186H61.722v59.04zm101.231 77.515c0-13.902-5.682-23.513-17.023-28.67-6.342-2.931-15.29-4.429-26.763-4.536H61.722v71.322h56.556c11.619 0 20.612-1.521 27.102-4.694 11.704-5.834 17.573-16.937 17.573-33.422zm265.466-43.539c1.302 8.756 1.891 21.46 1.652 38.065H290.493c.77 19.266 7.421 32.739 20.035 40.449 7.607 4.835 16.83 7.196 27.63 7.196 11.388 0 20.67-2.879 27.815-8.797 3.893-3.137 7.327-7.565 10.296-13.152h51.16c-1.34 11.379-7.5 22.92-18.57 34.648-17.151 18.641-41.205 27.988-72.097 27.988-25.52 0-48.011-7.883-67.533-23.592C249.772 307.777 240 282.211 240 246.746c0-33.257 8.773-58.712 26.378-76.43 17.67-17.751 40.474-26.586 68.583-26.586 16.661 0 31.68 2.978 45.079 8.965 13.357 5.993 24.396 15.425 33.09 28.388 7.868 11.416 12.928 24.616 15.289 39.653zm-50.357 4.994c-.938-13.322-5.386-23.405-13.395-30.296-7.943-6.91-17.866-10.379-29.706-10.379-12.886 0-22.836 3.708-29.906 10.996-7.118 7.273-11.547 17.161-13.362 29.68h86.369v-.001z"/></svg>',
          link: '#'
        }
      ],
      polygons: [
        {
          view: 'POLYGON_FIRST'
        },
        {
          view: 'POLYGON_SECOND'
        },
        {
          view: 'POLYGON_THIRD'
        },
      ],
      caption: {
        text: 'Интернет-магазин',
        view: 'HOME'
      }
    },
    header: {
      isMenuOpened: false
    },
    start: {
      info: {
        list: {
          first: {
            title: 'приемущества',
            items: [
              {
                text: 'Быстрый запуск'
              },
              {
                text: 'Легкость в поддержке'
              },
              {
                text: 'Стандартный функционал'
              },
            ]
          },
          second: {
            title: 'кому подходит',
            items: [
              {
                text: 'Малому и среднему бизнесу'
              },
              {
                text: 'Магазинам до 10 000 товаров'
              },
              {
                text: 'Начинающим бизнесам'
              },
            ]
          },
        },
        nextArrow: {
          view: 'NEXT',
          link: '/start/functional',
          text: 'функционал'
        },
        step: {
          number: 1,
        },
        btn: {
          text: 'Заказать',
          view: 'STEPS'
        },
        caption: {
          text: 'Быстрый старт',
          view: 'STEPS'
        },
        price: '800-1500 $',
        period: '2-4 нед.',
      },
      functional: {
        year: {
          view: 'FUNCTIONAL__YEAR'
        },
        logo: {
          view: 'FUNCTIONAL__LOGO'
        },
        nextArrow: {
          view: 'NEXT',
          text: 'технологии'
        },
        prevArrow: {
          view: 'PREV',
          text: 'описание'
        },
        step: {
          number: 2,
        },
        btn: {
          text: 'Заказать',
          view: 'STEPS'
        },
        caption: {
          text: 'функционал',
          view: 'STEPS',
        },
        list: {
          first: {
            title: 'главная страница',
            items: [
              {
                text: 'Большой баннер',
                year: '2018',
                logo: '/img/makeup-logo.png',
                img: '/img/makeup-main.png'
              },
              {
                text: 'Превью товаров',
                year: '2018',
                logo: '/img/kasta-logo.png',
                img: '/img/kasta-main.png'
              },
              {
                text: 'Список товарных категорий'
              },
              {
                text: 'Новости, акции и обзоры'
              },
              {
                text: 'Преимущества магазина'
              },
              {
                text: 'Мультиязычность'
              },
            ]
          },
        }
      },
      technologies: {
        prevArrow: {
          view: 'PREV',
          text: 'ФУНКЦИОНАЛ'
        },
        step: {
          number: 3,
        },
        btn: {
          text: 'Заказать',
          view: 'STEPS'
        },
        caption: {
          text: 'ТЕХНОЛОГИИ',
          view: 'STEPS',
        },
      },
    }
  },
  mutations: {
    openMenu(state) {
      state.header.isMenuOpened = true;
    },
    closeMenu(state) {
      state.header.isMenuOpened = false;
    },
  },
  actions: {}
});
